package main

import (
    "fmt"
    "myleetcode/数学与数字-直线上最多的点数/normal"
)

func main() {
    //points := [][]int{{1,1}, {2,2}, {3,3}}
    //points := [][]int{{1,1}, {3,2}, {5,3}, {4,1}, {2,3}, {1,4}}
    //points := [][]int{{0,0}}
    //points := [][]int{{3,10}, {0,2}, {0,2}, {3,10}}   //4
    //points := [][]int{{0,0}, {1,1}, {1,-1}} //2
    //points := [][]int{{-4,-4}, {-8,-582}, {-3,-3}, {-9, -651}, {9, 591}} //3
    //points := [][]int{{0,0}, {0,0}} //2
    //points := [][]int{{-4,1}, {-7,7}, {-1,5}, {9,-25}} //3
    points := [][]int{{1,1}, {1,1}, {0,0}, {3,4}, {4,5}, {5,6}, {7,8}, {8,9}}   //5
    fmt.Print(normal.MaxPoints(points))
}
